In [2]:
import numpy as np
import pandas as pd

In [3]:
dizi=np.array([[1,2,3],[4,5,6],[7,8,9]])

In [12]:
pd.Series(data=dizi[0],index=["elma","armut","cilek"])

elma     1
armut    2
cilek    3
dtype: int32

In [13]:
pd.DataFrame(dizi)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [14]:
tablo=pd.DataFrame(dizi,["satır1","satır2","satır3"],["kolon1","kolon2","kolon3"])

In [15]:
tablo

        kolon1  kolon2  kolon3
satır1       1       2       3
satır2       4       5       6
satır3       7       8       9

In [18]:
tablo["kolon3"]

satır1    3
satır2    6
satır3    9
Name: kolon3, dtype: int32

In [23]:
tablo["kolon4"]={10:"satır1",20:"satır2",30:"satır3"}

In [24]:
tablo

        kolon1  kolon2  kolon3  kolon4
satır1       1       2       3      10
satır2       4       5       6      20
satır3       7       8       9      30

In [25]:
tablo.drop("kolon1",axis=1)

        kolon2  kolon3  kolon4
satır1       2       3      10
satır2       5       6      20
satır3       8       9      30

In [26]:
tablo.drop("satır2",0)

C:\Users\BURAK\AppData\Local\Temp/ipykernel_9640/3476830889.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only
  tablo.drop("satır2",0)

        kolon1  kolon2  kolon3  kolon4
satır1       1       2       3      10
satır3       7       8       9      30

In [28]:
tablo

        kolon1  kolon2  kolon3  kolon4
satır1       1       2       3      10
satır2       4       5       6      20
satır3       7       8       9      30

In [32]:
tablo["kolon5"]=[1,2,3]

In [35]:
tablo.set_index("kolon5")

        kolon1  kolon2  kolon3  kolon4
kolon5
1            1       2       3      10
2            4       5       6      20
3            7       8       9      30

In [39]:
tablo.index.names=["kolon2"]